## TF Plan for app
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 10 to add, 2 to change, 7 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                NAME                                 |
|----------|---------------------------------------------------------------------|
| recreate | `aws_acm_certificate_validation.fr[0]`                              |
|          | `aws_acm_certificate_validation.main`                               |
|          | `aws_route53_record.validation_fr[&quot;*.ressources.alpha.canada.ca&quot;]`  |
|          | `aws_route53_record.validation_fr[&quot;ressources.alpha.canada.ca&quot;]`    |
|          | `aws_route53_record.validation_main[&quot;*.resources.alpha.canada.ca&quot;]` |
|          | `aws_route53_record.validation_main[&quot;resources.alpha.canada.ca&quot;]`   |
| add      | `aws_amplify_branch.lr_staging`                                     |
|          | `aws_amplify_domain_association.learning_resources_staging_fr`      |
|          | `aws_route53_zone.en_learning_resources`                            |
|          | `aws_route53_zone.fr_learning_resources`                            |
| delete   | `aws_amplify_branch.alpha_staging[0]`                               |
| update   | `aws_amplify_app.learning_resources`                                |
|          | `aws_amplify_branch.main`                                           |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_acm_certificate_validation.fr[0] must be replaced
-/+ resource "aws_acm_certificate_validation" "fr" {
      ~ id                      = "2022-10-31 19:03:08.264 +0000 UTC" -> (known after apply)
      ~ validation_record_fqdns = [
          - "_0d8fef82db47fa56993df92a439fee03.ressources.alpha.canada.ca",
        ] -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_acm_certificate_validation.main must be replaced
-/+ resource "aws_acm_certificate_validation" "main" {
      ~ id                      = "2022-10-31 19:03:09.906 +0000 UTC" -> (known after apply)
      ~ validation_record_fqdns = [
          - "_d4d565c5582fb74e2e36118594986619.resources.alpha.canada.ca",
        ] -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_amplify_app.learning_resources will be updated in-place
  ~ resource "aws_amplify_app" "learning_resources" {
      ~ access_token                  = (sensitive value)
      ~ environment_variables         = {
          ~ "GOOGLE_ANALYTICS_ID"         = (sensitive value)
          + "PREVIEW_ENV"                 = "false"
          + "contentful_space_id"         = (sensitive value)
            # (8 unchanged elements hidden)
        }
        id                            = "d3ezatomadqu9b"
        name                          = "Learning Resources"
        tags                          = {}
        # (15 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_amplify_branch.alpha_staging[0] will be destroyed
  # (because aws_amplify_branch.alpha_staging is not in configuration)
  - resource "aws_amplify_branch" "alpha_staging" {
      - app_id                        = "d3ezatomadqu9b" -> null
      - arn                           = "arn:aws:amplify:ca-central-1:774443804833:apps/d3ezatomadqu9b/branches/staging" -> null
      - associated_resources          = [] -> null
      - branch_name                   = "staging" -> null
      - custom_domains                = [] -> null
      - display_name                  = "staging" -> null
      - enable_auto_build             = true -> null
      - enable_basic_auth             = false -> null
      - enable_notification           = false -> null
      - enable_performance_mode       = false -> null
      - enable_pull_request_preview   = true -> null
      - environment_variables         = {
          - "DOMAIN_EN" = "staging.resources.alpha.canada.ca"
          - "DOMAIN_FR" = "staging.ressources.alpha.canada.ca"
        } -> null
      - framework                     = "NuxtJS" -> null
      - id                            = "d3ezatomadqu9b/staging" -> null
      - pull_request_environment_name = "PULL_REQUEST" -> null
      - stage                         = "BETA" -> null
      - tags                          = {} -> null
      - tags_all                      = {} -> null
      - ttl                           = "5" -> null
    }

  # aws_amplify_branch.lr_staging will be created
  + resource "aws_amplify_branch" "lr_staging" {
      + app_id                        = "d3ezatomadqu9b"
      + arn                           = (known after apply)
      + associated_resources          = (known after apply)
      + branch_name                   = "staging"
      + custom_domains                = (known after apply)
      + destination_branch            = (known after apply)
      + display_name                  = "staging"
      + enable_auto_build             = true
      + enable_pull_request_preview   = true
      + environment_variables         = {
          + "DOMAIN_EN" = "staging.resources.alpha.canada.ca"
          + "DOMAIN_FR" = "staging.ressources.alpha.canada.ca"
          + "ENV"       = "prod"
        }
      + framework                     = "NuxtJS"
      + id                            = (known after apply)
      + pull_request_environment_name = "PULL_REQUEST"
      + source_branch                 = (known after apply)
      + stage                         = "BETA"
      + tags_all                      = (known after apply)
    }

  # aws_amplify_branch.main will be updated in-place
  ~ resource "aws_amplify_branch" "main" {
      ~ enable_pull_request_preview   = true -> false
        id                            = "d3ezatomadqu9b/main"
      - pull_request_environment_name = "RELEASE" -> null
        tags                          = {}
        # (15 unchanged attributes hidden)
    }

  # aws_amplify_domain_association.learning_resources_en[0] has moved to aws_amplify_domain_association.learning_resources_en
    resource "aws_amplify_domain_association" "learning_resources_en" {
        id                                  = "d3ezatomadqu9b/resources.alpha.canada.ca"
        # (5 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_amplify_domain_association.learning_resources_fr[0] has moved to aws_amplify_domain_association.learning_resources_fr
    resource "aws_amplify_domain_association" "learning_resources_fr" {
        id                                  = "d3ezatomadqu9b/ressources.alpha.canada.ca"
        # (5 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_amplify_domain_association.learning_resources_staging_en[0] has moved to aws_amplify_domain_association.learning_resources_staging_en
    resource "aws_amplify_domain_association" "learning_resources_staging_en" {
        id                                  = "d3ezatomadqu9b/staging.resources.alpha.canada.ca"
        # (5 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_amplify_domain_association.learning_resources_staging_fr will be created
  + resource "aws_amplify_domain_association" "learning_resources_staging_fr" {
      + app_id                              = "d3ezatomadqu9b"
      + arn                                 = (known after apply)
      + certificate_verification_dns_record = (known after apply)
      + domain_name                         = "staging.ressources.alpha.canada.ca"
      + id                                  = (known after apply)
      + wait_for_verification               = false

      + sub_domain {
          + branch_name = "staging"
          + dns_record  = (known after apply)
          + verified    = (known after apply)
        }
      + sub_domain {
          + branch_name = "staging"
          + dns_record  = (known after apply)
          + prefix      = "www"
          + verified    = (known after apply)
        }
    }

  # aws_route53_record.validation_fr["*.ressources.alpha.canada.ca"] must be replaced
-/+ resource "aws_route53_record" "validation_fr" {
      ~ fqdn                             = "_0d8fef82db47fa56993df92a439fee03.ressources.alpha.canada.ca" -> (known after apply)
      ~ id                               = "Z059117134H8IUYM497ZX__0d8fef82db47fa56993df92a439fee03.ressources.alpha.canada.ca._CNAME" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
        name                             = "_0d8fef82db47fa56993df92a439fee03.ressources.alpha.canada.ca"
      ~ zone_id                          = "Z059117134H8IUYM497ZX" -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

  # aws_route53_record.validation_fr["ressources.alpha.canada.ca"] must be replaced
-/+ resource "aws_route53_record" "validation_fr" {
      ~ fqdn                             = "_0d8fef82db47fa56993df92a439fee03.ressources.alpha.canada.ca" -> (known after apply)
      ~ id                               = "Z059117134H8IUYM497ZX__0d8fef82db47fa56993df92a439fee03.ressources.alpha.canada.ca._CNAME" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
        name                             = "_0d8fef82db47fa56993df92a439fee03.ressources.alpha.canada.ca"
      ~ zone_id                          = "Z059117134H8IUYM497ZX" -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

  # aws_route53_record.validation_main["*.resources.alpha.canada.ca"] must be replaced
-/+ resource "aws_route53_record" "validation_main" {
      ~ fqdn                             = "_d4d565c5582fb74e2e36118594986619.resources.alpha.canada.ca" -> (known after apply)
      ~ id                               = "Z04956991BYJ39MOQV3MM__d4d565c5582fb74e2e36118594986619.resources.alpha.canada.ca._CNAME" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
        name                             = "_d4d565c5582fb74e2e36118594986619.resources.alpha.canada.ca"
      ~ zone_id                          = "Z04956991BYJ39MOQV3MM" -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

  # aws_route53_record.validation_main["resources.alpha.canada.ca"] must be replaced
-/+ resource "aws_route53_record" "validation_main" {
      ~ fqdn                             = "_d4d565c5582fb74e2e36118594986619.resources.alpha.canada.ca" -> (known after apply)
      ~ id                               = "Z04956991BYJ39MOQV3MM__d4d565c5582fb74e2e36118594986619.resources.alpha.canada.ca._CNAME" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
        name                             = "_d4d565c5582fb74e2e36118594986619.resources.alpha.canada.ca"
      ~ zone_id                          = "Z04956991BYJ39MOQV3MM" -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

  # aws_route53_zone.en_learning_resources will be created
  + resource "aws_route53_zone" "en_learning_resources" {
      + arn                 = (known after apply)
      + comment             = "Managed by Terraform"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "resources.alpha.canada.ca"
      + name_servers        = (known after apply)
      + primary_name_server = (known after apply)
      + tags_all            = (known after apply)
      + zone_id             = (known after apply)
    }

  # aws_route53_zone.fr_learning_resources will be created
  + resource "aws_route53_zone" "fr_learning_resources" {
      + arn                 = (known after apply)
      + comment             = "Managed by Terraform"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "ressources.alpha.canada.ca"
      + name_servers        = (known after apply)
      + primary_name_server = (known after apply)
      + tags_all            = (known after apply)
      + zone_id             = (known after apply)
    }

Plan: 10 to add, 2 to change, 7 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.fr[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.main"]
WARN - plan.json - main - Missing Common Tags: ["aws_amplify_app.learning_resources"]
WARN - plan.json - main - Missing Common Tags: ["aws_amplify_branch.lr_staging"]
WARN - plan.json - main - Missing Common Tags: ["aws_amplify_branch.main"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.learning_resources"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.app"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.en_learning_resources"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.fr_learning_resources"]

26 tests, 17 passed, 9 warnings, 0 failures, 0 exceptions

```

</details>
